In [2]:
!ls

Users  timeseries.ipynb

In [3]:
# azureml-core of version 1.0.72 or higher is required
# azureml-dataprep[pandas] of version 1.1.34 or higher is required
from azureml.core import Workspace, Dataset

subscription_id = '73e2b9e2-1b33-4342-888f-25aca2d5563f'
resource_group = 'domado'
workspace_name = 'shaktiman'

workspace = Workspace(subscription_id, resource_group, workspace_name)

dataset = Dataset.get_by_name(workspace, name='superstoredataset')
df = dataset.to_pandas_dataframe()
df.head()

            Row ID        Order ID Order Date     Sales    Profit Column24
2016-11-08       1  CA-2016-152156 2016-11-08  261.9600   41.9136     None
2016-11-08       2  CA-2016-152156 2016-11-08  731.9400  219.5820     None
2016-06-12       3  CA-2016-138688 2016-06-12   14.6200    6.8714     None
2015-10-11       4  US-2015-108966 2015-10-11  957.5775 -383.0310     None
2015-10-11       5  US-2015-108966 2015-10-11   22.3680    2.5164     None

In [4]:
import warnings
warnings.filterwarnings("ignore")
import itertools # Truth tables, series -> iterations 
import numpy as np
import matplotlib.pyplot as plt
import matplotlib
# Jupyter-> specific
%matplotlib inline

#Timeseries models
import statsmodels.api as sm

In [5]:
len(df)

9994

In [8]:
data = df.groupby('Order Date')
data_grouped_sales = data['Sales'].sum().reset_index()
data_grouped_profit = data['Profit'].sum().reset_index()
data_grouped_sales.tail()

     Order Date      Sales
1232 2017-12-26   769.8440
1233 2017-12-27   177.6360
1234 2017-12-28  1657.3508
1235 2017-12-29  2915.5340
1236 2017-12-30   713.7900

In [11]:
data_grouped_profit.head(8)
# there are DATES for which data is missing

  Order Date     Profit
0 2014-01-03     0.2000
1 2014-01-04   -65.9901
2 2014-01-05     4.8840
3 2014-01-06  1358.0524
4 2014-01-07   -53.7096
5 2014-01-09    10.9180
6 2014-01-10    22.6537
7 2014-01-11     3.0814

In [12]:
data = data_grouped_sales.set_index('Order Date') # main dataset remains unchanged
# data_grouped_sales.set_index('Order Date', inplace=True) # index changed on main dataset itself

In [13]:
data.head()

               Sales
Order Date
2014-01-03     0.000
2014-01-04   288.060
2014-01-05    19.536
2014-01-06  4407.100
2014-01-07    83.728